---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionsDisplayOption
source: html/5f7a04d5-121d-48fd-22c1-65cce420802f.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionsDisplayOption Property

Identifies the angular dimensions display options.

## Syntax (C#)
```csharp
public BendingDetailAngularDimensionsDisplayOptions AngularDimensionsDisplayOption { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration